package HomeWorks;

public class Main {
	/* 일정을 관리하는 프로그램을 작성하시오
	 * -------------------
	 * 한 사람의 일정을 관리하는 프로그램 이게 왜 쉽노 시발련ㄴ아
	 * -------------------
	 * 메뉴
	 * 1. 일정 추가
	 * 2. 일정 수정
	 * 3. 일정 삭제
	 * 4. 일정 확인
	 * 5. 프로그램 종료
	 * 메뉴 선택 : 
	 * 뻐킹 반복문 
	 * 1 번 프로그램
	 * 날짜 : yyyy-MM-dd hh:mm
	 * 일정 : 퇴근은 불가능하다
	 * 상세 : 있겠냐 일해라 노예야
	 * ----------------
	 * 일정이 추가되었습니다
	 * ----------------
	 * 2번 프로그램
	 * 수정할 일정 선택 : 1 
	 * 날짜 : yyyy-MM-dd hh:mm
	 * 일정 : 퇴근은 불가능하다
	 * 상세 : 있다고? 실화임?
	 * ----------------
	 * 수정이 완료 되었습니다
	 * ----------------
	 * 3번 프로그램
	 * 삭제할 일정 선택 : 1
	 * ----------
	 * 삭제되었습니다
	 * ----------
	 * 4번 프로그램
	 * ----------
	 * 날짜 : yyyy-MM-dd hh:mm
	 * 일정 : 퇴근은 불가능하다
	 * 상세 : 있겠냐 일해라 노예야
	 * ----------
	 * 메뉴로 가시려면 엔터를 입력하세요
	 * 5번 프로그램
	 * 프로그램을 종료합니다
	 * 왜 이게 쉽지 ㅅㅂ
	 * ------------
	 * 어려운 놈
	 * 메인 메뉴
	 * 1. 회원관리
	 * 2. 일정관리
	 * 3. 프로그램 종료
	 * 메뉴 선택 : 
	 * -------------
	 * 회원메뉴
	 * 1. 회원 추가
	 * 2. 회원 수정
	 * 3. 회원 삭제
	 * 4. 이전으로
	 * --------------
	 * 메뉴
	 * 1. 일정 추가
	 * 2. 일정 수정
	 * 3. 일정 삭제
	 * 4. 일정 확인
	 * 5. 이전으로
	 * 메뉴 선택 : 
	 * ----------
	 * 1번 프로그램
	 * ----------
	 * 추가할 회원 정보 입력
	 * 아이디 : 
	 * 이름 : 
	 * ----------------
	 * 회원이 추가되었습니다
	 * ----------------
	 * 2번 프로그램
	 * 아이디 : 
	 * ----------------
	 * 수정할 이름 : 
	 * ----------------
	 * 회원정보를 수정했습니다
	 * ----------------
	 * 3번 프로그램
	 * ----------------
	 * 회원 정보를 삭제했습니다
	 * ----------------
	 * 있는 아이디는 출력하고 없는 아이디 검색 시 없는 회원입니다 출력
	 * ㅈ같은 놈이네 이거
	 * */
	public static void main(String[] args) {
		

	}

}
